In [1]:
import pandas as pd

In [2]:
df=pd.read_excel("data into pdf.xlsx")

In [3]:
df

  name  age  salary
0    a   24   24000
1    b   12   12000
2    c   45   45000
3    d   23   23000
4    e   56   56000
5    f   54   54000

In [4]:
df[0:3]

  name  age  salary
0    a   24   24000
1    b   12   12000
2    c   45   45000

In [5]:
import random
s="abcdef"

In [6]:
for i in range(len(df)):
    m=open("{}.pdf".format(random.choice(s)),"w")
    m.write(str(df[i:i+1]))
    m.close()

In [ ]:
#in this we used"{}.pdf".format(random.choice(s)) by this we randomly get the choice in the s var.